In [2]:
import pandas as pd
import numpy as np
stuff = {'Corporation': ['Apple', 'Google', 'Meta', 'Apple', 'Google', 'Meta'],
         'Employees': ['John', 'April', 'Wes', 'Beth', 'Justin', 'Steph'],
         'Salary': [200, 220, 190, 130, 120, 150]}
my_df = pd.DataFrame(stuff)
my_df

  Corporation Employees  Salary
0       Apple      John     200
1      Google     April     220
2        Meta       Wes     190
3       Apple      Beth     130
4      Google    Justin     120
5        Meta     Steph     150

In [5]:
company = my_df.groupby('Corporation')
company

In [18]:
company.sum(numeric_only=True)

             Salary
Corporation
Apple           330
Google          340
Meta            340

In [16]:
company.mean(numeric_only=True)

             Salary
Corporation
Apple         165.0
Google        170.0
Meta          170.0

In [10]:
company.max()

            Employees  Salary
Corporation
Apple            John     200
Google         Justin     220
Meta              Wes     190

In [13]:
company.std(numeric_only=True)

                Salary
Corporation
Apple        49.497475
Google       70.710678
Meta         28.284271

In [15]:
company.var(numeric_only=True)

             Salary
Corporation
Apple        2450.0
Google       5000.0
Meta          800.0

In [19]:
company.count()

             Employees  Salary
Corporation
Apple                2       2
Google               2       2
Meta                 2       2